wrk6/wrk_2003_r_10min_v2_Heavy.txt
wrk -t 3 -c 3 -d600 -R 50 -math 0 --latency http://13.0.0.29:8081/high/web730m.html
Running 10m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.02m     2.84m    9.81m    57.58%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    314310.66 ms
 75.000%    449576.96 ms
 90.000%    533200.90 ms
 99.000%    589299.71 ms
 99.900%    589299.71 ms
 99.990%    589299.71 ms
 99.999%    589299.71 ms
100.000%    589299.71 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   12361.727     0.000000            1         1.00
   70647.807     0.100000            4         1.11
  113704.959     0.200000            7         1.25
  163577.855     0.300000           10         1.43
  246939.647     0.400000           14         1.67
  314310.655     0.500000           17         2.00
  349962.239     0.550000           19         2.22
  362807.295     0.600000           20         2.50
  390070.271     0.650000           22         2.86
  418381.823     0.700000           24         3.33
  449576.959     0.750000           25         4.00
  462946.303     0.775000           26         4.44
  475791.359     0.800000           27         5.00
  489422.847     0.825000           28         5.71
  517472.255     0.850000           29         6.67
  517472.255     0.875000           29         8.00
  533200.895     0.887500           30         8.89
  533200.895     0.900000           30        10.00
  546832.383     0.912500           31        11.43
  546832.383     0.925000           31        13.33
  546832.383     0.937500           31        16.00
  564658.175     0.943750           32        17.78
  564658.175     0.950000           32        20.00
  564658.175     0.956250           32        22.86
  564658.175     0.962500           32        26.67
  564658.175     0.968750           32        32.00
  589299.711     0.971875           33        35.56
  589299.711     1.000000           33          inf
#[Mean    =   300909.661, StdDeviation   =   170628.892]
#[Max     =   588775.424, Total count    =           33]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    12910.59 ms
 75.000%    19955.71 ms
 90.000%    22102.01 ms
 99.000%    29065.22 ms
 99.900%    29065.22 ms
 99.990%    29065.22 ms
 99.999%    29065.22 ms
100.000%    29065.22 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10633.215     0.000000            1         1.00
   10805.247     0.100000            4         1.11
   10911.743     0.200000            7         1.25
   11018.239     0.300000           10         1.43
   12042.239     0.400000           14         1.67
   12910.591     0.500000           17         2.00
   13787.135     0.550000           19         2.22
   15949.823     0.600000           20         2.50
   16515.071     0.650000           22         2.86
   19021.823     0.700000           24         3.33
   19955.711     0.750000           25         4.00
   21282.815     0.775000           26         4.44
   21528.575     0.800000           27         5.00
   21643.263     0.825000           28         5.71
   21807.103     0.850000           29         6.67
   21807.103     0.875000           29         8.00
   22102.015     0.887500           30         8.89
   22102.015     0.900000           30        10.00
   26312.703     0.912500           31        11.43
   26312.703     0.925000           31        13.33
   26312.703     0.937500           31        16.00
   28426.239     0.943750           32        17.78
   28426.239     0.950000           32        20.00
   28426.239     0.956250           32        22.86
   28426.239     0.962500           32        26.67
   28426.239     0.968750           32        32.00
   29065.215     0.971875           33        35.56
   29065.215     1.000000           33          inf
#[Mean    =    15608.987, StdDeviation   =     5545.479]
#[Max     =    29048.832, Total count    =           33]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  33 requests in 10.03m, 24.08GB read
  Socket errors: connect 0, read 0, write 0, timeout 248
Requests/sec:      0.05
Transfer/sec:     41.00MB
Running 10m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.25m     2.98m    9.94m    54.29%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    329777.15 ms
 75.000%    461635.58 ms
 90.000%    553123.84 ms
 99.000%    596639.74 ms
 99.900%    596639.74 ms
 99.990%    596639.74 ms
 99.999%    596639.74 ms
100.000%    596639.74 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11345.919     0.000000            1         1.00
   62816.255     0.100000            4         1.11
  112263.167     0.200000            7         1.25
  180223.999     0.300000           11         1.43
  255590.399     0.400000           14         1.67
  329777.151     0.500000           18         2.00
  355205.119     0.550000           20         2.22
  379584.511     0.600000           21         2.50
  409731.071     0.650000           23         2.86
  445382.655     0.700000           25         3.33
  480247.807     0.750000           27         4.00
  495976.447     0.775000           28         4.44
  495976.447     0.800000           28         5.00
  512753.663     0.825000           29         5.71
  526909.439     0.850000           30         6.67
  540540.927     0.875000           31         8.00
  553123.839     0.887500           32         8.89
  553123.839     0.900000           32        10.00
  553123.839     0.912500           32        11.43
  566755.327     0.925000           33        13.33
  566755.327     0.937500           33        16.00
  583008.255     0.943750           34        17.78
  583008.255     0.950000           34        20.00
  583008.255     0.956250           34        22.86
  583008.255     0.962500           34        26.67
  583008.255     0.968750           34        32.00
  596639.743     0.971875           35        35.56
  596639.743     1.000000           35          inf
#[Mean    =   315078.949, StdDeviation   =   178608.761]
#[Max     =   596115.456, Total count    =           35]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    12877.82 ms
 75.000%    18661.38 ms
 90.000%    21528.58 ms
 99.000%    26558.46 ms
 99.900%    26558.46 ms
 99.990%    26558.46 ms
 99.999%    26558.46 ms
100.000%    26558.46 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10674.175     0.000000            1         1.00
   10731.519     0.100000            4         1.11
   10878.975     0.200000            7         1.25
   10985.471     0.300000           11         1.43
   11255.807     0.400000           14         1.67
   12877.823     0.500000           18         2.00
   13451.263     0.550000           20         2.22
   13860.863     0.600000           21         2.50
   15237.119     0.650000           23         2.86
   17891.327     0.700000           25         3.33
   18694.143     0.750000           27         4.00
   18890.751     0.775000           28         4.44
   18890.751     0.800000           28         5.00
   20938.751     0.825000           29         5.71
   21200.895     0.850000           30         6.67
   21512.191     0.875000           31         8.00
   21528.575     0.887500           32         8.89
   21528.575     0.900000           32        10.00
   21528.575     0.912500           32        11.43
   22003.711     0.925000           33        13.33
   22003.711     0.937500           33        16.00
   23871.487     0.943750           34        17.78
   23871.487     0.950000           34        20.00
   23871.487     0.956250           34        22.86
   23871.487     0.962500           34        26.67
   23871.487     0.968750           34        32.00
   26558.463     0.971875           35        35.56
   26558.463     1.000000           35          inf
#[Mean    =    14821.552, StdDeviation   =     4650.381]
#[Max     =    26542.080, Total count    =           35]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35 requests in 10.03m, 25.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 244
Requests/sec:      0.06
Transfer/sec:     42.63MB
Running 10m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.98m     2.94m    9.81m    57.14%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    305397.76 ms
 75.000%    449314.82 ms
 90.000%    537919.49 ms
 99.000%    589299.71 ms
 99.900%    589299.71 ms
 99.990%    589299.71 ms
 99.999%    589299.71 ms
100.000%    589299.71 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10846.207     0.000000            1         1.00
   56950.783     0.100000            4         1.11
  111542.271     0.200000            7         1.25
  163839.999     0.300000           11         1.43
  221642.751     0.400000           14         1.67
  305397.759     0.500000           18         2.00
  340787.199     0.550000           20         2.22
  354156.543     0.600000           21         2.50
  385875.967     0.650000           23         2.86
  416284.671     0.700000           25         3.33
  461897.727     0.750000           27         4.00
  483131.391     0.775000           28         4.44
  483131.391     0.800000           28         5.00
  495976.447     0.825000           29         5.71
  509607.935     0.850000           30         6.67
  522977.279     0.875000           31         8.00
  537919.487     0.887500           32         8.89
  537919.487     0.900000           32        10.00
  537919.487     0.912500           32        11.43
  562561.023     0.925000           33        13.33
  562561.023     0.937500           33        16.00
  575668.223     0.943750           34        17.78
  575668.223     0.950000           34        20.00
  575668.223     0.956250           34        22.86
  575668.223     0.962500           34        26.67
  575668.223     0.968750           34        32.00
  589299.711     0.971875           35        35.56
  589299.711     1.000000           35          inf
#[Mean    =   298787.635, StdDeviation   =   176645.743]
#[Max     =   588775.424, Total count    =           35]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    11288.58 ms
 75.000%    15450.11 ms
 90.000%    22986.75 ms
 99.000%    30228.48 ms
 99.900%    30228.48 ms
 99.990%    30228.48 ms
 99.999%    30228.48 ms
100.000%    30228.48 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10641.407     0.000000            1         1.00
   10747.903     0.100000            4         1.11
   10838.015     0.200000            7         1.25
   10969.087     0.300000           11         1.43
   11010.047     0.400000           14         1.67
   11288.575     0.500000           18         2.00
   13328.383     0.550000           20         2.22
   13475.839     0.600000           21         2.50
   13828.095     0.650000           23         2.86
   14802.943     0.700000           25         3.33
   16031.743     0.750000           27         4.00
   17465.343     0.775000           28         4.44
   17465.343     0.800000           28         5.00
   18563.071     0.825000           29         5.71
   21168.127     0.850000           30         6.67
   21725.183     0.875000           31         8.00
   22986.751     0.887500           32         8.89
   22986.751     0.900000           32        10.00
   22986.751     0.912500           32        11.43
   27033.599     0.925000           33        13.33
   27033.599     0.937500           33        16.00
   27918.335     0.943750           34        17.78
   27918.335     0.950000           34        20.00
   27918.335     0.956250           34        22.86
   27918.335     0.962500           34        26.67
   27918.335     0.968750           34        32.00
   30228.479     0.971875           35        35.56
   30228.479     1.000000           35          inf
#[Mean    =    14588.197, StdDeviation   =     5401.158]
#[Max     =    30212.096, Total count    =           35]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35 requests in 10.01m, 25.21GB read
  Socket errors: connect 0, read 0, write 0, timeout 243
Requests/sec:      0.06
Transfer/sec:     42.99MB